1c-configuration-manager/src/Catalogs/ОбъектыКонфигурации/ОбъектыКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыКонфигурации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Иерархический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИерархии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>23</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьКоличествоУровней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУровней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерииКодов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольУникальности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНумерация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подчиненный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМетаданные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

1c-configuration-manager/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>БизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>ВидРасчета</name>
  </enumValues>
  <enumValues>
    <name>ВидСубконто</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Задача</name>
  </enumValues>
  <enumValues>
    <name>Календарь</name>
  </enumValues>
  <enumValues>
    <name>НаборКонстант</name>
  </enumValues>
  <enumValues>
    <name>Перечисление</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ПланОбмена</name>
  </enumValues>
  <enumValues>
    <name>ПланСчетов</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>РегистрРасчета</name>
  </enumValues>
  <enumValues>
    <name>РегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>ТочкаМаршрутаБизнесПроцесса</name>
  </enumValues>
  <enumValues>
    <name>УникальныйИдентификатор</name>
  </enumValues>
  <enumValues>
    <name>ХранилищеЗначения</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Конфигурация</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийИсточникДанных</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийОтчет</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>Файл</name>
  </enumValues>
  <enumValues>
    <name>Папка</name>
  </enumValues>
  <enumValues>
    <name>ОбщийМодуль</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяКоманда</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяФорма</name>
  </enumValues>
  <enumValues>
    <name>Константа</name>
  </enumValues>
  <enumValues>
    <name>ЖурналДокументов</name>
  </enumValues>
  <enumValues>
    <name>ХранилищаНастроек</name>
  </enumValues>
  <enumValues>
    <name>ВебСервис</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовРасчетов</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Catalogs/ОбъектыКонфигурации/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьОтображениеПоТипу();
КонецПроцедуры



&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ИзменитьОтображениеПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеПоТипу()
	
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Файл") 
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ВнешнийОтчет")
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ВнешняяОбработка")Тогда
		Элементы.ГруппаНумерация.Видимость=Ложь;
	Иначе
		Элементы.ГруппаНумерация.Видимость=Истина;
	КонецЕсли;
	
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Справочник") 
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ПланСчетов")
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ПланВидовХарактеристик") Тогда
		Элементы.ГруппаИерархия.Видимость=Истина;
	Иначе
		Элементы.ГруппаИерархия.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры
